In [2]:
for i in range(1,10):
    print("fff")

fff
fff
fff
fff
fff
fff
fff
fff
fff

In [4]:
d = [1,2,3,4,5]

In [5]:
d

[1, 2, 3, 4, 5]

In [6]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns

In [7]:
df = pd.DataFrame(
    {
        'Name' :['Bob','John','Foo','Bar','Alex','Tom'],
        'Math' :['A+','B','A','F','D','C'],
        'English' : ['C','B','B','A+','F','A'],
        'Age' : [13,16,16,15,15,13]
    }
)

In [8]:
df

   Name Math English  Age
0   Bob   A+       C   13
1  John    B       B   16
2   Foo    A       B   16
3   Bar    F      A+   15
4  Alex    D       F   15
5   Tom    C       A   13

In [9]:
math = df.iloc[:,[0,1,-1]]
math.columns = ['Name','Grade','Age']

english = df.iloc[:,[0,2,-1]]
english.columns = ['Name','Grade','Age']

In [10]:
math['Subject'] = 'Math'
english['Subject'] = 'English'

In [11]:
pd.concat([math,english])

   Name Grade  Age  Subject
0   Bob    A+   13     Math
1  John     B   16     Math
2   Foo     A   16     Math
3   Bar     F   15     Math
4  Alex     D   15     Math
5   Tom     C   13     Math
0   Bob     C   13  English
1  John     B   16  English
2   Foo     B   16  English
3   Bar    A+   15  English
4  Alex     F   15  English
5   Tom     A   13  English

In [12]:
x = 'new test'